m5stack/uiflow-micropython/m5stack/boards/M5STACK_PaperMono/mpconfigboard.h
/*
* SPDX-FileCopyrightText: 2026 M5Stack Technology CO LTD
*
* SPDX-License-Identifier: MIT
*/

#define MICROPY_HW_BOARD_NAME               "M5STACK PaperMono"
#define MICROPY_HW_MCU_NAME                 "ESP32-S3R8"

#define MICROPY_PY_MACHINE_DAC              (0)

// Enable UART REPL for modules that have an external USB-UART and don't use native USB.
#define MICROPY_HW_ENABLE_UART_REPL         (0)

#define MICROPY_HW_I2C0_SCL                 (2)
#define MICROPY_HW_I2C0_SDA                 (3)

#define MICROPY_HW_USB_VID 0x303A
#define MICROPY_HW_USB_PID 0x816B
#define MICROPY_HW_USB_MANUFACTURER_STRING "M5Stack"
#define MICROPY_HW_USB_PRODUCT_FS_STRING "PaperMono(UiFlow2)"
#define MICROPY_HW_USB_CDC_INTERFACE_STRING "PaperMono(UiFlow2)"

// If not enable LVGL, ignore this...
#include "./../mpconfiglvgl.h"
